package com.code.codepractice.algorithm;

/**
 * 等比例函数
 */
public class Ratio {
    /**
     * 跳阶的题目
     * step 1 or 2 or 3 or 4 ...or n;
     * n个台阶有几种跳法
     * 递推
     * 台阶数                                                                               跳法
     * 1                                                                                           1
     * 2                                                                                           2
     * 3 (先1后2，2种；先2后1,1种；先3，1种) 2+1+1                                                 4
     * 4 (先1后3，4种；先2后2,2种；先3后1，1种，先4 1种) 4+2+1+1                                   8
     * 5 (先1后4，8种；先2后3,4种；先2后2，2种，先4后1，1种；先5 1种) 8+4+2+1+1                    16
     * 6 (先1后5，16种；先2后4,8种；先3后3，4种，先4后2，2种；先5后1 1种 先6 1种) 16+8+4+2+1+1     32
     * 2的(n-1)次方
     * 等比例数列
     */
    public Double ratio(int n) {
        return Math.pow(2, n - 1);
    }
}
